tutorials/reactiveTransport/reactiveTransportALEFoam/3DcalcitePost/0_org/H+
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      H+;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 -3 0 0 1 0 0];

internalField   uniform 1e-7;

boundaryField
{
    movingWalls
    {
        type            reactiveSurfaceConcentrationMixed;
        k               8.9125e-4; //kmol/m2/s;
        scoeff          2;//
        value           uniform 0;
    }

    right
    {
        type            zeroGradient;
    }

    left
    {
        type            fixedValue;
        value           uniform 0.0126;
    }

    top
    {
        type            zeroGradient;
    }

    bottom
    {
       type zeroGradient;
    }

    frontAndBack
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
